Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70J21.PIC
      <edc:SFRDef edc:_addr="0x40050558" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ6" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005055C" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ7" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050560" edc:offset="0xA0"/>
      <edc:SFRDef edc:_addr="0x40050600" edc:access="--------------------ww--www--ww-" edc:cname="GMAC_IERPQ0" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050604" edc:access="--------------------ww--www--ww-" edc:cname="GMAC_IERPQ1" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050608" edc:offset="0x18"/>
      <edc:SFRDef edc:_addr="0x40050620" edc:access="--------------------ww--www--ww-" edc:cname="GMAC_IDRPQ0" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050624" edc:access="--------------------ww--www--ww-" edc:cname="GMAC_IDRPQ1" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050628" edc:offset="0x18"/>
      <edc:SFRDef edc:_addr="0x40050640" edc:access="--------------------nn--nnn--nn-" edc:cname="GMAC_IMRPQ0" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AHB" edc:desc="AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
